[
  {
    "id": 1,
    "overall": 1.0,
    "reviewText": "I am very disappointed. There is no hangover in this movie. I loved first two movies.\n\nThe Hangover part 3 is disappointed, no hangover and bored. Part 1 and 2 was better",
    "reviewerID": "ALM7GD5S4ZDC2"
  },
  {
    "id": 2,
    "overall": 1.0,
    "reviewText": "I kept waiting for something to happen, but all this is is a diatribe of past accusations\/presentregrets and overall I ran it forward in parts and pretty much skipped parts - perhaps I missed some glorious cinematic interpretation, but it did not appeal to me at all. Try it, but I would  not recommend it as \"entertaining,\" notwithstanding all the \"awards\" and \"recognitions\" documented !! I am obviously a \"pleb!?\"",
    "reviewerID": "A3PN375089WF0U"
  },
  {
    "id": 3,
    "overall": 2.0,
    "reviewText": "Not memorable",
    "reviewerID": "A1NFEI180L5GVP"
  },
  {
    "id": 4,
    "overall": 2.0,
    "reviewText": "That a movie could be this terrible and at the same time star Guinness, Morley, and Lotabridgework, is a stunning reality.  How bad is Hotel Paradiso?  Well, most characters in the film have red hair, run around a lot, and shout at each other endlessly.  The story, such as it is, is wholly predictable.  And for humor we get a man who stutters and an assortment of fat ladies. I couldn't muster a smile, perhaps because I was in shock.\n\nEver wonder why this film has yet to appear in DVD?  Surely the rock bottom quality has something to do with it.  As for those high-priced VHS copies, taken from TCM, don't bother.",
    "reviewerID": "A3PHTB9X7B11XL"
  },
  {
    "id": 5,
    "overall": 3.0,
    "reviewText": "The performances are intense, to match the intensity of the story.  The storytelling felt a little disjointed at times with an unclear ending.",
    "reviewerID": "AK8XO6YL8V1CP"
  },
  {
    "id": 6,
    "overall": 3.0,
    "reviewText": "SAW III goes for the jugular, and it succeeds in being repulsively fascinating in its expectedly perverse manner.  The most disturbing scene is not one of Jigsaw's many games, though---it's the operation performed on his brain to remove a piece of his skull to prevent him from dying.  It's pretty gruesome to say the least.\n\nAs for the movie itself, the writers seem to be trying to turn Jigsaw into some kind of mercy-seeking angel, trying to somehow justify his horrifying acts.  Sorry, folks...Jigsaw is pure evil, sociopathically immoral, and immune to the immense acts of torture he orchestrates with the assistance of his demented slave, well played by Shawnee Smith.  Tobin Bell is effective as Jigsaw, considering most of his time is spent in a hospital bed.  There are some horrifying acts of sadistic torture, and some good acting from Angus Macfayden as the man whose revenge leads him down a fatal path.  Bahar Soomekh is also effective as the doctor recruited to perform the operation on Jigsaw, or die herself.  Donnie Wahlberg and Dina Meyers return from SAW II, but they are merely torture objects in this one.\n\nSAW has had its moments, but the trilogy should stop now; it's focusing more on gore and shock than storylines, and even though you wouldn't think so, it does leave a door open for another sequel.  Do us a favor...stop while you're reasonably ahead.",
    "reviewerID": "A3LZGLA88K0LA0"
  },
  {
    "id": 7,
    "overall": 4.0,
    "reviewText": "Without doubt, one of the funniest movies I've seen in recent years!",
    "reviewerID": "A1GXIMU82HXNOB"
  },
  {
    "id": 8,
    "overall": 4.0,
    "reviewText": "Videos are good for daily practice, not terribly time-consuming. Easy to-follow instructions and there are no terribly difficult poses for a beginner.",
    "reviewerID": "A3NPDCU412WIN9"
  },
  {
    "id": 9,
    "overall": 5.0,
    "reviewText": "My box set arrived today and luckily despite Amazon's deplorable packaging it arrived in good condition.\nThe lamp, which is attached to a plastic base or platform feels a bit cheap to the touch and is made from a plastic composite.\nHaving said that once adjusted and placed on the shelf it looks spectacular.\nAs mentioned in previous reviews it runs on four AA size batteries and seems to be lit via small leds. It omits a soft glow rather than a harsh light (were you to use a conventional globe).\nThe base also houses a handy adjustable shelf which you can slot your various blu-ray cases.\nIt's larger than I envisioned and despite the cheap Chinese build, it's a centrepiece that I'm sure will impress all that view it (just don't let anyone play with it).\n\nAs long as you can purchase this and pick it up (would not take the risk with shipping) I would recommend it and if you are a big Pixar fan this item is the ultimate keepsake.\nJust like their movies which evoke emotion, this item will bring a smile to your face every time you glimpse it.\n\nAs far as the movie itself is concerned I can't really add anything that has already been stated in all the sterling reviews that have been posted however I will add that when I went and saw this at the cinemas some families left due to the high emotional response that their children had to some events throughout the movie. I don't want to give anything away but there were at least two points in the movie where children actually started to cry!\n\nSomething parents need to be aware of is that this Pixar offering is designed to be an emotional ride for the senses and that some children may not be fully equipped to deal with this at a tender age. It may definitely warrant a discussion on life after the credits have rolled. Not necessarily a bad thing.",
    "reviewerID": "A3LWNNLK2WY7DV"
  },
  {
    "id": 10,
    "overall": 5.0,
    "reviewText": "Saving Silverman is a laughing riot from start to end. After many years, have I seen such an amazing film with amazing performances. Jack Black stands out as the best guy in the film. He can't make you stop laughing. Steve Zahn gives an amazing performance as well. This laugh riot is a great entertainer for the entire family and a great pick for frineds. A must see and a must buy. Go for it. Trust me, you will laugh your bones out !!!",
    "reviewerID": "AAI8D7D8XXY1I"
  }
]