[
  {
    "id": 1,
    "overall": 1.0,
    "reviewText": "The scenary and acting were all very good and the story was compelling, but this story was not one you'd want to \"keep in your heart\". As a true story made into a movie, it was a BAD choice. I'd write more, but I don't want to spoil the whole (stupid) point of why I did NOT like this move. Waste of my time.",
    "reviewerID": "A2L0S5G4T7VMNI"
  },
  {
    "id": 2,
    "overall": 1.0,
    "reviewText": "awful..had to sit through 2+ hours of saccharine sweetness for the main social message that took all of the last 10 minutes of the movie!",
    "reviewerID": "A18RL4KEO9D7EY"
  },
  {
    "id": 3,
    "overall": 2.0,
    "reviewText": "it was OK",
    "reviewerID": "A305T13IR7JBN"
  },
  {
    "id": 4,
    "overall": 2.0,
    "reviewText": "Both bad copies. The VHS was better.",
    "reviewerID": "A27DZS8DUPUMWH"
  },
  {
    "id": 5,
    "overall": 3.0,
    "reviewText": "I agree with some of the other reviewers. \"The Associate\" was definitely worth a 5-star rating. Celtic Pride was lame, unrealistic, and on the same level as \"Dumb and Dumber\". \"The 6th Man\" was okay to watch once.",
    "reviewerID": "A1RJI2CUW8SX88"
  },
  {
    "id": 6,
    "overall": 3.0,
    "reviewText": "Purely average.",
    "reviewerID": "A1VSA6DM6Y1V24"
  },
  {
    "id": 7,
    "overall": 4.0,
    "reviewText": "This was the first Mae West film I have seen, and I was curious to see if she would live up to her reputation. She did. West stars as Lou, a singer with a penchant for diamonds and men. She's mixed up with a bunch of white slave traders and crooks. West has a wisecrack for everything, and more than enough male admirers to keep her busy. But the one guy she wants, she can't seem to get, and that's do-gooder Cary Grant, the recipient of her famous \"Come up and see me sometime\" line that has made her immortal in films. West has a great screen presence and she exudes sexuality. She must have been a shock to Thirties film audiences. The film moves along briskly (it's just over an hour), and the dialogue really keeps your attention, as does Mae. The lady had a way with words.",
    "reviewerID": "A1345VRK5MYG7"
  },
  {
    "id": 8,
    "overall": 4.0,
    "reviewText": "I wish Bozo was still on tv! My kids and I would watch it every morning. We loved the show when the kids would play games!",
    "reviewerID": "A1AQGDD8WLLPXG"
  },
  {
    "id": 9,
    "overall": 5.0,
    "reviewText": "Hey-\nLet me add my voice to those approving of this set. Great stories, great guest stars, top-notch writing that is adult and production values that are first-rate. I recently reviewed \"The Deputy\", and what a pleasant contrast this set is. Calhoun is outstanding as Bill Longley. Only Chuck Connors as The Rifleman or Hugh O'Brien as Wyatt Earp are comparable in western roles on TV. By all means, buy this set before it goes out-of-print. Now, how about a Bat Masterson set?",
    "reviewerID": "A2A2QGGPSG2DLJ"
  },
  {
    "id": 10,
    "overall": 5.0,
    "reviewText": "Very absorbing mini-series. Loved it, Interesting look at Asian business of the time. Brosnan is a great actor.",
    "reviewerID": "A189HXWVX6F8O6"
  }
]