[
    {
        "id": 1, 
        "overall":1.0,
        "reviewText":"This was painfully tedious to sit through.  There were a few good scenes but it just didn't mesh well together as a finished product. Tracie Thoms and  Idina Menzel were extraordinary; it wasn't enough to save this adaption.  Not worthy of a repeat viewing.",
        "reviewerID":"A2DAAMBYPSJY1W"
    },
    {
        "id": 2, 
        "overall":1.0,
        "reviewText":"I thought this movie was inane.  There was no intelligence to it at all.  I'm sorry I rented and watched it.",
        "reviewerID":"AKPFL6L42H5SZ"
    },
    {
        "id": 3, 
        "overall":1.0,
        "reviewText":"ugh this movie was awful",
        "reviewerID":"ASPFMBZB8R28F"
    },
    {
        "id": 4, 
        "overall":1.0,
        "reviewText":"did not keep my interest",
        "reviewerID":"A2NBHY4FHUBOG5"
    },
    {
        "id": 5, 
        "overall":1.0,
        "reviewText":"There is really nothing more I can say about the book nor the movie that hasn't already been said.  I read the book, said I would never watch the movie.  Well the movie came on public TV so I took a chance.\n\nI never pay attention to what the guide says about movies because I have found that many times my opinion differs.  This time the guide said the movie was a soap opera.  I should have paid attention to the guide.  However I did watch the whole movie because I felt the challenge to try to remember what the book said so I could figure out what was going on in the movie.\n\nNo to you purist this is not a review, but it is an expression of an opinion.",
        "reviewerID":"A26QG3LFDOZUDF"
    },
    {
        "id": 6, 
        "overall":1.0,
        "reviewText":"I guess I had a moment of DUH when I bought it because I didn't really like the previous part of this story.  I thought the production value was lacking and then, to have the same woman play the grandaughter?  Really?  LAME.\n\nIt was a very bad purchase and I wish I could 'return' it.",
        "reviewerID":"ARCNXP1PW7LR4"
    },
    {
        "id": 7, 
        "overall":2.0,
        "reviewText":"I expected more action. Too much documentary talk",
        "reviewerID":"AX5PGCOIQW7P"
    },
    {
        "id": 8, 
        "overall":2.0,
        "reviewText":"Actor did there best with what they had to work with. Story was broke up and hard to follow.",
        "reviewerID":"A2XAPTLTKKNO5D"
    },
    {
        "id": 9, 
        "overall":2.0,
        "reviewText":"A rather confused and eclectic documentary on Bigfoot, black cats and UFO-type phenomena. Annoying music in the background, and pretty amateurish from a technical viewpoint. You probably don't have to watch it, unless you are about 1000% hooked on Bigfoot-paranormal stuff.",
        "reviewerID":"A2VMT89TCSF105"
    },
    {
        "id": 10, 
        "overall":2.0,
        "reviewText":"Ya, nothing good to say, so.......",
        "reviewerID":"A3F4N0GY2HG71B"
    },
    {
        "id": 11, 
        "overall":2.0,
        "reviewText":"This was not okay. Great actors but the plot and dialogue was lacking.",
        "reviewerID":"A25NQ4PBC8EXOR"
    },
    {
        "id": 12, 
        "overall":2.0,
        "reviewText":"It's not a bad movie. It's just not a movie anyone would laugh out loud to.  I mean you'll smile once in a while if you grew up in the 80's\/90's but, in the end it's a Sandler movie. Don't expect too much and you won't be disappointed.\n\nViolating Q Bert was wrong. Just... wrong.",
        "reviewerID":"A2Z933XK49GBOY"
    },
    {
        "id": 13, 
        "overall":3.0,"reviewText":"I had looked up the movie on imdb.com before buying it; so I had a rough idea of what was supposed to happen.  However, I wasn't prepared for how it started to drag.  So, I looked it up on wikipedia to try to get a better idea.  Shortly after I looked it up, it started moving along better.  The structure is similar to Vantage Point in that it is the \"same\" story told over and over.  (I'm not a fan of either one.)  It was a sweet movie, and it left an opening for a sequel if they felt the necessity to make one, but it's a complete story on its own.",
        "reviewerID":"A2T2M4AFUVIT4I"
    },
    {
        "id": 14, 
        "overall":3.0,
        "reviewText":"Tom Welling, Selma Blair and Maggie Grace star\nin this 2005 horror remake of John Carpenter's\n1980 film. A town is haunted by a mysterious\nfog with vengeful ghosts on it's 100th birthday.\nThis is ok, but the original is better. This dvd\nhas nice picture and sound plus neat extras.\nI still recommend this.",
        "reviewerID":"A1W702WG1LC6R3"
    },
    {
        "id": 15, 
        "overall":3.0,
        "reviewText":"A German high school class project spins out of control, as one teacher's efforts to demonstrate the ease with which a willing public can be enchanted by an autocracy unwittingly ends up glamorizing it. The blunt, one-note lesson is clearly meant for viewer and participant alike, and that gives the unenviable impression we're being lectured to, warned against the catastrophic risks without fully understanding the flip side. The speed and relative ease with which this diverse classroom is willing to conform to a hive-mind is suspect, as is the instructor's dull misunderstanding of the stakes. It's well-acted and some of its steep, lofty warnings hit home, but the extremes of that message and the melodramatic tones it constantly strikes remind me of an after-school special. A great topic, with a harsh climax, that falls into far too many traps.",
        "reviewerID":"A1TJIJKKN15KR9"
    },
    {
        "id": 16, 
        "overall":3.0,
        "reviewText":"The sets were cheesy. That graphics a bit dated and some of the plot was foolish. But, the six films with Eva are worth it just to see her. She is a good actress and and a stunningly beautiful lady. Wow...",
        "reviewerID":"A25N3JGX4QUZCA"
    },
    {
        "id": 17, 
        "overall":3.0,
        "reviewText":"Thought I was going to be laughing non stop, but it's more heartwarming than hilarious.  I liked the ending, not to cheesey",
        "reviewerID":"A39FVKNWIHSZQ0"
    },
    {
        "id": 18, 
        "overall":3.0,
        "reviewText":"Gritty and sad",
        "reviewerID":"A1O5KY4EYJPWWE"
    },
    {
        "id": 19, 
        "overall":4.0,
        "reviewText":"The movie was enjoyable.",
        "reviewerID":"APIOXDL6IMCGP"
    },
    {
        "id": 20, 
        "overall":4.0,
        "reviewText":"This is a good movie but be warned the quality is poor. A worthy movie considering the price on Amazon look for it in bargin bins also. Carol Baker is also in this movie if you are an old movie buff.",
        "reviewerID":"A20L037OGCIXJB"
    },
    {
        "id": 12, 
        "overall":4.0,
        "reviewText":"I enjoy the combat between the client and Psychological of the events. I think he can handle that many only.",
        "reviewerID":"AE922FW2QEJHD"
    },
    {
        "id": 22, 
        "overall":4.0,
        "reviewText":"I took a chance with this movie, not knowing what to expect, and I was very pleasantly surprised at how wonderful it was! Such a touching and moving story ... I have to admit the acting was not the best (excluding Cheryl Ladd of course who's always wonderful), but actually, the script is so good it really didn't seem to matter ! Highly recommended for everyone !",
        "reviewerID":"A1CVCVRLP0V9RG"
    },
    {
        "id": 23, 
        "overall":4.0,
        "reviewText":"enyoyed watching",
        "reviewerID":"AIFJQN5DF4I0N"
    },
    {
        "id": 24, 
        "overall":4.0,
        "reviewText":"I'm enjoying this season as much as the first two!",
        "reviewerID":"ATPOXZ08YHBNZ"
    },
    {
        "id": 25, 
        "overall":5.0,
        "reviewText":"I love Clint Walker. The movie was excellent.",
        "reviewerID":"ARNS5LU079K3T"
    },
    {
        "id": 26, 
        "overall":5.0,
        "reviewText":"Great",
        "reviewerID":"ALADBFMAAKXQJ"
    },
    {
        "id": 27, 
        "overall":5.0,
        "reviewText":"These movies are the best!  Sandra Dee is great and James Darren is a perfect Moondoggie!!  Love the Big Kahuna, too!!",
        "reviewerID":"A2COMNVMMAOU9I"
    },
    {
        "id": 28, 
        "overall":5.0,
        "reviewText":"killer movie",
        "reviewerID":"A1F5E0HFQNX21M"
    },
    {
        "id": 29, 
        "overall":5.0,
        "reviewText":"GREAT VIDEO .  GREAT PURCHASE FROM THE AMAZON.  PLAN ON BUYING MORE IN THE FUTURE.  LOVED WATCHING LIBRARIAN & GANG FIGHT BADDIES!!!",
        "reviewerID":"A2K9ECAOZPABIY"
    },
    {
        "id": 0, 
        "overall":5.0,
        "reviewText":"they don't make 'em like this anymore........great movie.........fantasy\/comedy where dick powell is \"reincarnated\" in human form in order to solve the mystery of his death (as a dog!!!!!). hilarious sequences, including the police, who have no idea what they're in for (once they suspect powell as \"the killer\"). if i had a complaint, it's that the movie is ungodly short............",
        "reviewerID":"ASPTWWXTZX2MI"
    }
]
