[
  {
      "id": 1, 
      "overall":1.0,
      "reviewText":"This was painfully tedious to sit through.  There were a few good scenes but it just didn't mesh well together as a finished product. Tracie Thoms and  Idina Menzel were extraordinary; it wasn't enough to save this adaption.  Not worthy of a repeat viewing.",
      "reviewerID":"A2DAAMBYPSJY1W"
  },
  {
      "id": 2, 
      "overall":1.0,
      "reviewText":"I thought this movie was inane.  There was no intelligence to it at all.  I'm sorry I rented and watched it.",
      "reviewerID":"AKPFL6L42H5SZ"
  },
  {
      "id": 3, 
      "overall":1.0,
      "reviewText":"ugh this movie was awful",
      "reviewerID":"ASPFMBZB8R28F"
  },
  {
      "id": 4, 
      "overall":1.0,
      "reviewText":"did not keep my interest",
      "reviewerID":"A2NBHY4FHUBOG5"
  },
  {
      "id": 5, 
      "overall":1.0,
      "reviewText":"There is really nothing more I can say about the book nor the movie that hasn't already been said.  I read the book, said I would never watch the movie.  Well the movie came on public TV so I took a chance.\n\nI never pay attention to what the guide says about movies because I have found that many times my opinion differs.  This time the guide said the movie was a soap opera.  I should have paid attention to the guide.  However I did watch the whole movie because I felt the challenge to try to remember what the book said so I could figure out what was going on in the movie.\n\nNo to you purist this is not a review, but it is an expression of an opinion.",
      "reviewerID":"A26QG3LFDOZUDF"
  },
  {
      "id": 6, 
      "overall":1.0,
      "reviewText":"I guess I had a moment of DUH when I bought it because I didn't really like the previous part of this story.  I thought the production value was lacking and then, to have the same woman play the grandaughter?  Really?  LAME.\n\nIt was a very bad purchase and I wish I could 'return' it.",
      "reviewerID":"ARCNXP1PW7LR4"
  },
  {
      "id": 7, 
      "overall":2.0,
      "reviewText":"I expected more action. Too much documentary talk",
      "reviewerID":"AX5PGCOIQW7P"
  },
  {
      "id": 8, 
      "overall":2.0,
      "reviewText":"Actor did there best with what they had to work with. Story was broke up and hard to follow.",
      "reviewerID":"A2XAPTLTKKNO5D"
  },
  {
      "id": 9, 
      "overall":2.0,
      "reviewText":"A rather confused and eclectic documentary on Bigfoot, black cats and UFO-type phenomena. Annoying music in the background, and pretty amateurish from a technical viewpoint. You probably don't have to watch it, unless you are about 1000% hooked on Bigfoot-paranormal stuff.",
      "reviewerID":"A2VMT89TCSF105"
  },
  {
      "id": 10, 
      "overall":2.0,
      "reviewText":"Ya, nothing good to say, so.......",
      "reviewerID":"A3F4N0GY2HG71B"
  },
  {
      "id": 11, 
      "overall":2.0,
      "reviewText":"This was not okay. Great actors but the plot and dialogue was lacking.",
      "reviewerID":"A25NQ4PBC8EXOR"
  },
  {
      "id": 12, 
      "overall":2.0,
      "reviewText":"It's not a bad movie. It's just not a movie anyone would laugh out loud to.  I mean you'll smile once in a while if you grew up in the 80's\/90's but, in the end it's a Sandler movie. Don't expect too much and you won't be disappointed.\n\nViolating Q Bert was wrong. Just... wrong.",
      "reviewerID":"A2Z933XK49GBOY"
  },
  {
      "id": 13, 
      "overall":3.0,"reviewText":"I had looked up the movie on imdb.com before buying it; so I had a rough idea of what was supposed to happen.  However, I wasn't prepared for how it started to drag.  So, I looked it up on wikipedia to try to get a better idea.  Shortly after I looked it up, it started moving along better.  The structure is similar to Vantage Point in that it is the \"same\" story told over and over.  (I'm not a fan of either one.)  It was a sweet movie, and it left an opening for a sequel if they felt the necessity to make one, but it's a complete story on its own.",
      "reviewerID":"A2T2M4AFUVIT4I"
  },
  {
      "id": 14, 
      "overall":3.0,
      "reviewText":"Tom Welling, Selma Blair and Maggie Grace star\nin this 2005 horror remake of John Carpenter's\n1980 film. A town is haunted by a mysterious\nfog with vengeful ghosts on it's 100th birthday.\nThis is ok, but the original is better. This dvd\nhas nice picture and sound plus neat extras.\nI still recommend this.",
      "reviewerID":"A1W702WG1LC6R3"
  },
  {
      "id": 15, 
      "overall":3.0,
      "reviewText":"A German high school class project spins out of control, as one teacher's efforts to demonstrate the ease with which a willing public can be enchanted by an autocracy unwittingly ends up glamorizing it. The blunt, one-note lesson is clearly meant for viewer and participant alike, and that gives the unenviable impression we're being lectured to, warned against the catastrophic risks without fully understanding the flip side. The speed and relative ease with which this diverse classroom is willing to conform to a hive-mind is suspect, as is the instructor's dull misunderstanding of the stakes. It's well-acted and some of its steep, lofty warnings hit home, but the extremes of that message and the melodramatic tones it constantly strikes remind me of an after-school special. A great topic, with a harsh climax, that falls into far too many traps.",
      "reviewerID":"A1TJIJKKN15KR9"
  },
  {
      "id": 16, 
      "overall":3.0,
      "reviewText":"The sets were cheesy. That graphics a bit dated and some of the plot was foolish. But, the six films with Eva are worth it just to see her. She is a good actress and and a stunningly beautiful lady. Wow...",
      "reviewerID":"A25N3JGX4QUZCA"
  },
  {
      "id": 17, 
      "overall":3.0,
      "reviewText":"Thought I was going to be laughing non stop, but it's more heartwarming than hilarious.  I liked the ending, not to cheesey",
      "reviewerID":"A39FVKNWIHSZQ0"
  },
  {
      "id": 18, 
      "overall":3.0,
      "reviewText":"Gritty and sad",
      "reviewerID":"A1O5KY4EYJPWWE"
  },
  {
      "id": 19, 
      "overall":4.0,
      "reviewText":"The movie was enjoyable.",
      "reviewerID":"APIOXDL6IMCGP"
  },
  {
      "id": 20, 
      "overall":4.0,
      "reviewText":"This is a good movie but be warned the quality is poor. A worthy movie considering the price on Amazon look for it in bargin bins also. Carol Baker is also in this movie if you are an old movie buff.",
      "reviewerID":"A20L037OGCIXJB"
  },
  {
      "id": 12, 
      "overall":4.0,
      "reviewText":"I enjoy the combat between the client and Psychological of the events. I think he can handle that many only.",
      "reviewerID":"AE922FW2QEJHD"
  },
  {
      "id": 22, 
      "overall":4.0,
      "reviewText":"I took a chance with this movie, not knowing what to expect, and I was very pleasantly surprised at how wonderful it was! Such a touching and moving story ... I have to admit the acting was not the best (excluding Cheryl Ladd of course who's always wonderful), but actually, the script is so good it really didn't seem to matter ! Highly recommended for everyone !",
      "reviewerID":"A1CVCVRLP0V9RG"
  },
  {
      "id": 23, 
      "overall":4.0,
      "reviewText":"enyoyed watching",
      "reviewerID":"AIFJQN5DF4I0N"
  },
  {
      "id": 24, 
      "overall":4.0,
      "reviewText":"I'm enjoying this season as much as the first two!",
      "reviewerID":"ATPOXZ08YHBNZ"
  },
  {
      "id": 25, 
      "overall":5.0,
      "reviewText":"I love Clint Walker. The movie was excellent.",
      "reviewerID":"ARNS5LU079K3T"
  },
  {
      "id": 26, 
      "overall":5.0,
      "reviewText":"Great",
      "reviewerID":"ALADBFMAAKXQJ"
  },
  {
      "id": 27, 
      "overall":5.0,
      "reviewText":"These movies are the best!  Sandra Dee is great and James Darren is a perfect Moondoggie!!  Love the Big Kahuna, too!!",
      "reviewerID":"A2COMNVMMAOU9I"
  },
  {
      "id": 28, 
      "overall":5.0,
      "reviewText":"killer movie",
      "reviewerID":"A1F5E0HFQNX21M"
  },
  {
      "id": 29, 
      "overall":5.0,
      "reviewText":"GREAT VIDEO .  GREAT PURCHASE FROM THE AMAZON.  PLAN ON BUYING MORE IN THE FUTURE.  LOVED WATCHING LIBRARIAN & GANG FIGHT BADDIES!!!",
      "reviewerID":"A2K9ECAOZPABIY"
  },
  {
      "id": 30, 
      "overall":5.0,
      "reviewText":"they don't make 'em like this anymore........great movie.........fantasy\/comedy where dick powell is \"reincarnated\" in human form in order to solve the mystery of his death (as a dog!!!!!). hilarious sequences, including the police, who have no idea what they're in for (once they suspect powell as \"the killer\"). if i had a complaint, it's that the movie is ungodly short............",
      "reviewerID":"ASPTWWXTZX2MI"
  },
  {
    "id": 31,
    "overall":1.0,
    "reviewText":"This is a sincere warning. Do NOT watch!\nMy time is wasted even to write how loosely knitted this film is.\nAnother 'The Girl with dragon tattoo' hype.",
    "reviewerID":"A23UZKJ4NQTLA9"
  },
  {
    "id": 32,
    "overall":1.0,
    "reviewText":"The original was a slice of perfection, this is a pile of steaming dung.  Have I been unnecessarily vague?  Let me try again: this film was a waste of their talents and my time and money.  It should be listed in Webster's as an antonym for the word \"entertainment.\"  Take a pig's carcass, coat it in chicken droppings, then put it in a dumpster for the entire month of July and it won't stink 1\/10th as much as this insult to filmmakers everywhere, past, present and future.  P.U.!!!",
    "reviewerID":"A3SH9XRYW8UZSL"
  },
  {
    "id": 33,
    "overall":1.0,
    "reviewText":"Lame",
    "reviewerID":"A29AQ2J5K05UAO"
  },
  {
    "id": 34,
    "overall":1.0,
    "reviewText":"Why oh, why after over 20 years of aerobic workouts does Denise Austin not know how to cue? This dvd is a mess of her uncoordinated dance moves. It is truly hilarious watching her back-ups aerobizers try and keep up with her crazy moves.  It almost appears as if she makes all these moves up as she goes along(like she did on her tv program). When she does cue, it is wrong. Denise is better at pilates and simple toning. Her Personal Training dvd and Hit the Spot Pilates are her two best dvds. Stay away from this one, you won't like it.",
    "reviewerID":"A1M1F73GJYD85O"
  },
  {
    "id": 35,
    "overall":1.0,
    "reviewText":"I wish I hadn't even started this, awful, period. Bad acting, bad special effect and just a terrible storyline. Dont put yourself through this",
    "reviewerID":"ASTV93CUOBV9B"
  },
  {
    "id": 36,
    "overall":1.0,
    "reviewText":"What person in their right mind gave this director $ for this turkey? Worst movie I've ever seen.",
    "reviewerID":"A1VWLGL4Y8WHQD"
  },
  {
    "id": 37,
    "overall":2.0,
    "reviewText":"The book was MUCH better than the movie.",
    "reviewerID":"A6L475F38TW7E"
  },
  {
    "id": 38,
    "overall":2.0,
    "reviewText":"The basic idea behind this intrigued me which is why I was generous enough to give it 2 stars.  Hardly a plot at all and one of the worst endings I've seen in a movie in a long time.  Good effects, but used in a very cheesy manner.\nThe acting is not very good, the plot doesn't go very far...just read these other reviews.  Read AMAZON's review at the front.  That'll tell you what you need to know.",
    "reviewerID":"A1BLAEPIU3GWQ3"
  },
  {
    "id": 39,
    "overall":2.0,
    "reviewText":"This is B\/w film from the 60's. Appreciated it for 2 reasons: very strong female role, ad for effective object lesson in living under communism. On the other hand, my husband didn't like it because it was a cold war propaganda film with unrealistic assumptions about escaping in a closed country with no prior knowledge of secret instillations, etc.",
    "reviewerID":"AM6E9TNSBJPE1"
  },
  {
    "id": 40,
    "overall":2.0,
    "reviewText":"Sloooooooowwww moving movie. But several Scarlett naked shots",
    "reviewerID":"A3OB5BQBK5NXSV"
  },
  {
    "id": 41,
    "overall":2.0,
    "reviewText":"Awful. Being a Tim Burton film it had its moments--some interesting visuals, a few fun and\/or dark moments--but on the whole it was poorly written and entirely forgettable.  Ultra-loyal, die hard Burton fans might find this worth watching.  If you're one of those, you know you have to see it.  For your average fan like me who's grown up loving most of his films but still doesn't want to waste his time or money on a bad movie, you've been forewarned.  I think this might well be Burton's worst film to date.",
    "reviewerID":"A2BXVL1JW115LS"
  },
  {
    "id": 42,
    "overall":2.0,
    "reviewText":"Elizabeth Moss is excellent! I've never seen her before (no cable), and she is *perfect* in this.\n\nSome pretty creepy trashy characters.\nHolly Hunter's character is too over-the-top, bordering on corny. Nope, it passes corny and I blame the writers. That character could have worked if they'd been a little more subtle about it, but they tried too hard and it just makes me roll my eyes whenever she spoke.\n\nThe scenery is spectacular, and  yet I wouldn't want to live there.\n\nOverall, it's depressing people-wise and in atmosphere.\n\nMy guess is that this series is trying to imitate the dark wonderful quirkiness of Twin Peaks. *braaaaap!* fail.",
    "reviewerID":"ASJE1XJY3EIN2"
  },
  {
    "id": 43,
    "overall":3.0,
    "reviewText":"Interesting day to day.",
    "reviewerID":"A9ONCPQ96X346"
  },
  {
    "id": 44,
    "overall":3.0,
    "reviewText":"Plenty of action",
    "reviewerID":"A2KO1PSGPA29L3"
  },
  {
    "id": 45,
    "overall":3.0,
    "reviewText":"The first half builds well and has the potential for going to unexpected places but the film completely stalls in the second half. Dolan seems much more interested in long closeups of himself than in follow-through. I could have written a better ending. A letdown.",
    "reviewerID":"A1XK5SZKQJVDTI"
  },
  {
    "id": 46,
    "overall":3.0,
    "reviewText":"It was an okay movie. Relatable if you are widowed and spend a lot of time alone but also inspirational - you want a different life - go out and make it happen.",
    "reviewerID":"A11VIFGR4W70YW"
  },
  {
    "id": 47,
    "overall":3.0,
    "reviewText":"Meh. It is an okay movie, but not as good as the earlier Sparks novel to movie adaptations. I feel like the last few have left something to be desired. Of course, his writing style also seems to have changed - as if he is writing the books for the big screen now.",
    "reviewerID":"A2SR8BMGS0UN8D"
  },
  {
    "id": 48,
    "overall":3.0,
    "reviewText":"This was a cute enjoyable movie.",
    "reviewerID":"A2VHHPTF03MPGE"
  },
  {
    "id": 49,
    "overall":4.0,
    "reviewText":"European production staff filming in ancient Italy in real villages and castles and forests have achieved A+ production values. Sets, lighting, props, costumes, make-up, casting, music... all have that historical ease\/medieval fluency and 'over-the-top' design factor that Italian passionate creatives often do so superbly. (Ever see Franco Zeffirelli's 'Romeo And Juliet'?)\n\nThe plot, however... well, it's DARK. And somewhat hallucinagenic\/nonsensical\/split up... Grimm's original fairy tales were like that too, now much cleaned up for children's happy consumption.\nTHIS IS NOT A CHILDREN'S MOVIE.\nSex, nudity, violence and a creepy, desolate worldview make it highly inappropriate!\nBut if you want to be 'swept away' to an alternate reality for a couple of hours, this is for YOU",
    "reviewerID":"AJ2RZYT0YS43X"
  },
  {
    "id": 50,
    "overall":4.0,
    "reviewText":"If you like your horror a bit on the goofy side this may be for you.\nNot too graphic, although there was some gore it was more the type you might see in your local haunted hayride or haunted house attraction, not the more realistic type. The stories were silly and campy and fun. I especially liked the one about the kidnapping that went wrong, and the modernized version of Hansel and Gretal\nI only rented, I did not purchase but I may consider buying it to watch again because yes it was just that much fun.",
    "reviewerID":"A17RW6P0XAHW1H"
  },
  {
    "id": 51,
    "overall":4.0,
    "reviewText":"This is the best video quality version of this movie I have ever seen.  It is still creepy after all these years.",
    "reviewerID":"A3DVY8X5YLNFVF"
  },
  {
    "id": 52,
    "overall":4.0,
    "reviewText":"Great Classic Romantic Comedy",
    "reviewerID":"A4ZYQTRDRZ5TM"
  },
  {
    "id": 53,
    "overall":4.0,
    "reviewText":"As a non-Muslim, I found this movie fascinating; it gives you an interesting glance and walk though of the sexual and social does and don'ts of a society very different from that of the West.  The scenes are great -- appear to be shot on site -- acting is realistic and convincing.  I was impressed and recommend the movie for someone who wishes to do a quick soak in the culture of the mid-East.",
    "reviewerID":"A3KUDRJ8E1OKUI"
  },
  {
    "id": 54,
    "overall":4.0,
    "reviewText":"Looking forward to another season. Hope it happens!",
    "reviewerID":"A2RMPMDC6VAY4P"
  },
  {
    "id": 55,
    "overall":5.0,
    "reviewText":"I love this movie.",
    "reviewerID":"A2KICB6I3KMO9B"
  },
  {
    "id": 56,
    "overall":5.0,
    "reviewText":"Loved it",
    "reviewerID":"A9GJGRJXU9516"
  },
  {
    "id": 57,
    "overall":5.0,
    "reviewText":"I'm a ballroom dancer and can relate. Enjoyed it.",
    "reviewerID":"AW66G2I4VN28U"
  },
  {
    "id": 58,
    "overall":5.0,
    "reviewText":"This season is action packed because they packed in the fourth and fifth season plot arcs, afraid this was the last season. Things evolve quickly, but it is incredible to see.",
    "reviewerID":"A18B5QL328E02A"
  },
  {
    "id": 59,
    "overall":5.0,
    "reviewText":"What can I say, she just plain hilarious.",
    "reviewerID":"A356K8GU36BH5A"
  },
  {
    "id": 60,
    "overall":5.0,
    "reviewText":"The arguments against processed and GMO foods are not new. The stranglehold of pharmacology on the health care world is also well known. What I appreciated most about this docu was the info concerning vitamin therapy, detoxification and organic produce. We live in the information age and different interests are competing to control the very nature of truth, fact and reality. The people in this film suggest a focus on whole plant foods and vitamins. If you test it out for yourself, they have little or nothing to gain by it; plus there's no danger in it as long as you test it gradually (esp vitamins). Ultimately one cannot be free to make informed decisions when one cannot know objective truth. This approach can be tested reasonably safely to determine how it will affect one's health.",
    "reviewerID":"A26NIMJ0UK8OYB"
  }
]
